import * as React from 'react';
import { StyleRules, WithStyles, withStyles } from '@material-ui/core/styles';
import { RouteComponentProps, withRouter } from 'react-router';
import { Typography, Paper } from '@material-ui/core';

const styles: StyleRules<'root'|'paper'> = {
    root: {
        width: '100%',
        display: 'flex',
        justifyContent: 'center',
        marginTop: 20
    },
    paper: {
        width: '90%',
        maxWidth: 700
    }
};

type ClassNames = keyof typeof styles;


class Terms extends React.Component<
                                            RouteComponentProps<any> &
                                            WithStyles<ClassNames>, 
                                            {}> {

   public render(): JSX.Element {
        const {classes} = this.props;
        return (
            <div className={classes.root}>
                <Paper className={classes.paper}>
                    <Typography variant="headline" component="h3">
                    利用規約
                    </Typography>
<br />
                    <Typography component="p">
この利用規約（以下，「本規約」といいます。）は，aknow2（以下，「当社」といいます。）が提供するサービス（以下，「サービス」といいます。）またはアプリケーション（以下，「アプリ」といいます。）の利用条件を定めるものです。ご利用のユーザーの皆さま（以下，「ユーザー」といいます。）には，本規約に従って，本サービスやアプリケーションをご利用いただきます。また、アプリやサービスを使用するために必要な携帯端末、通信機器、通信手段等は、利用者の費用と責任で備えるものとします。
</Typography>
<br />
<Typography component="p">
第1条（適用）<br />
本規約は，ユーザーと当社との間のサービスとアプリの利用に関わる一切の関係に適用されるものとします。
</Typography>
<br />
<Typography component="p">
第2条（利用）<br />
・ユーザーは、本規約の内容に承諾したうえで、アプリやサービスを利用するものとします。また、本規約は利用者がアプリやサービスを利用した日をもってその効力を発するものとします。

・登録が必要なサービスやアプリに関しては、希望者が当社の定める方法によって利用登録を申請し，当社がこれを承認することによって，利用登録が完了するものとします。当社は，利用登録の申請者に以下の事由があると判断した場合，利用登録の申請を承認しないことがあり，その理由については一切の開示義務を負わないものとします。
（1）利用登録の申請に際して虚偽の事項を届け出た場合
（2）本規約に違反したことがある者からの申請である場合
（3）その他，当社が利用登録を相当でないと判断した場合
</Typography>
<br />
<Typography component="p">
第3条（ユーザーIDおよびパスワードの管理）<br />
ユーザーIDとパスワードが必要なサービスやアプリについては、ユーザーは，自己の責任において，本サービスのユーザーIDおよびパスワードを管理するものとします。
ユーザーは，いかなる場合にも，ユーザーIDおよびパスワードを第三者に譲渡または貸与することはできません。当社は，ユーザーIDとパスワードの組み合わせが登録情報と一致してログインされた場合には，そのユーザーIDを登録しているユーザー自身による利用とみなします。
</Typography>
<br />
<Typography component="p">
第4条（広告）<br />
アプリやサービスに表示される広告・宣伝を行っている広告主との取引は、ユーザーと該当広告主の責任において行ってください。当社は、アプリやサービスに掲載される広告によって発生した損害及び掲載された事実に起因する損害に関しては一切の責任を負いません。また、当社は広告枠及び広告表示の位置、表示期間等の仕様に関して、予告なく変更を行う場合があります。
</Typography>
<br />
<Typography component="p">
第5条（禁止事項）<br />
ユーザーは，本サービスの利用にあたり，以下の行為をしてはなりません。
<br />
<br />
（1）法令または公序良俗に違反する行為<br />
（2）犯罪行為に関連する行為<br />
（3）当社のサーバーまたはネットワークの機能を破壊したり，妨害したりする行為<br />
（4）当社のサービスの運営を妨害するおそれのある行為<br />
（5）他のユーザーに関する個人情報等を収集または蓄積する行為<br />
（6）他のユーザーに成りすます行為<br />
（7）当社のサービスに関連して，反社会的勢力に対して直接または間接に利益を供与する行為<br />
（8）その他，当社が不適切と判断する行為<br />
</Typography>
<br />
<Typography component="p">
第6条（本サービスの提供の停止等）<br />
当社は，以下のいずれかの事由があると判断した場合，ユーザーに事前に通知することなく本サービスの全部または一部の提供を停止または中断することができるものとします。<br /><br />
（1）本サービスにかかるコンピュータシステムの保守点検または更新を行う場合<br />
（2）地震，落雷，火災，停電または天災などの不可抗力により，本サービスの提供が困難となった場合<br />
（3）コンピュータまたは通信回線等が事故により停止した場合<br />
（4）その他，当社が本サービスの提供が困難と判断した場合<br /><br />
当社は，本サービスの提供の停止または中断により，ユーザーまたは第三者が被ったいかなる不利益または損害について，理由を問わず一切の責任を負わないものとします。
</Typography>
<br />
<Typography component="p">
第7条（利用制限および登録抹消）<br />
当社は，以下の場合には，事前の通知なく，ユーザーに対して，本サービスの全部もしくは一部の利用を制限し，またはユーザーとしての登録を抹消することができるものとします。<br /><br />
（1）本規約のいずれかの条項に違反した場合<br />
（2）登録事項に虚偽の事実があることが判明した場合<br />
（3）その他，当社が本サービスの利用を適当でないと判断した場合<br />
当社は，本条に基づき当社が行った行為によりユーザーに生じた損害について，一切の責任を負いません。<br />
</Typography>
<br />
<Typography component="p">
第8条（免責事項）<br />
当社の債務不履行責任は，当社の故意または重過失によらない場合には免責されるものとします。<br />
当社は，何らかの理由によって責任を負う場合にも，通常生じうる損害の範囲内かつ有料サービスにおいては代金額（継続的サービスの場合には1か月分相当額）の範囲内においてのみ賠償の責任を負うものとします。
当社は，本サービスに関して，ユーザーと他のユーザーまたは第三者との間において生じた取引，連絡または紛争等について一切責任を負いません。
</Typography>
<br />
<Typography component="p">
第9条（サービス内容の変更等）<br />
当社は，ユーザーに通知することなく，本サービスの内容を変更しまたは本サービスの提供を中止することができるものとし，これによってユーザーに生じた損害について一切の責任を負いません。
</Typography>
<br />
<Typography component="p">
第10条（利用規約の変更）<br />
当社は，必要と判断した場合には，ユーザーに通知することなくいつでも本規約を変更することができるものとします。
</Typography>
<br />
<Typography component="p">
第11条（通知または連絡）<br />
ユーザーと当社との間の通知または連絡は，当社の定める方法によって行うものとします。
</Typography>
<br />
<Typography component="p">
第12条（権利義務の譲渡の禁止）<br />
ユーザーは，当社の書面による事前の承諾なく，利用契約上の地位または本規約に基づく権利もしくは義務を第三者に譲渡し，または担保に供することはできません。
</Typography>
<br />
<Typography component="p">
第13条（準拠法・裁判管轄）<br />
本規約の解釈にあたっては，日本法を準拠法とします。
本サービスに関して紛争が生じた場合には，当社の本店所在地を管轄する裁判所を専属的合意管轄とします。
</Typography>
<br /><br />
<Typography component="p">
以上 2018年10月 制定<br />

                    </Typography>
                </Paper>
            </div>
        );
    }

}

const StyledContainer = withStyles<{} & ClassNames>(styles)(Terms);

export default withRouter(StyledContainer);